---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetInsulationSpecificationGroup(System.Int32)
source: html/dec6f45a-0b84-46c9-37a6-8dc9dbdc024e.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetInsulationSpecificationGroup Method

Gets the insulation specification group from its identifier.

## Syntax (C#)
```csharp
public string GetInsulationSpecificationGroup(
	int specId
)
```

## Parameters
- **specId** (`System.Int32`) - The insulation specification identifier.

## Returns
The insulation specification group.